oscillatingCylinderInChannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            codedFixedValue;
        name            oscillatingCylinderVelocity;

        code
        #{
            const scalar A = 0.25;
            const scalar f = 0.25;
            const scalar twoPiF = 2.0*constant::mathematical::pi*f;
            const scalar t = db().time().value();
            const vector v(A*twoPiF*cos(twoPiF*t), 0.0, 0.0);
            operator==(v);
        #};

        value           uniform (0 0 0);
    }
    "left|right|up|down"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
