oscillatingCylinderInChannel/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            calculated;

        // type            codedFixedValue;
        // name            oscillatingCylinderPointDisplacement;

        // code
        // #{
        //     const scalar x0 = 1.0;
        //     const scalar A = 0.25;
        //     const scalar f = 0.25;
        //     const scalar twoPiF = 2.0*constant::mathematical::pi*f;
        //     const scalar t = db().time().value();
        //     const vector x(x0 + A*sin(twoPiF*t), 0.0, 0.0);
        //     operator==(x);
        // #};

        value           uniform (0 0 0);
    }
    "left|right"
    {
        // type            fixedDisplacement;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "up|down"
    {
        type            slip;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
