oscillatingCylinderInChannel/constant/timeVsDisplacement
(
( 0.000 ( 0.000000 0 0 ))
( 0.005 ( 0.001963 0 0 ))
( 0.010 ( 0.003927 0 0 ))
( 0.015 ( 0.005890 0 0 ))
( 0.020 ( 0.007853 0 0 ))
( 0.025 ( 0.009815 0 0 ))
( 0.030 ( 0.011777 0 0 ))
( 0.035 ( 0.013738 0 0 ))
( 0.040 ( 0.015698 0 0 ))
( 0.045 ( 0.017657 0 0 ))
( 0.050 ( 0.019615 0 0 ))
( 0.055 ( 0.021572 0 0 ))
( 0.060 ( 0.023527 0 0 ))
( 0.065 ( 0.025481 0 0 ))
( 0.070 ( 0.027434 0 0 ))
( 0.075 ( 0.029384 0 0 ))
( 0.080 ( 0.031333 0 0 ))
( 0.085 ( 0.033280 0 0 ))
( 0.090 ( 0.035225 0 0 ))
( 0.095 ( 0.037168 0 0 ))
( 0.100 ( 0.039109 0 0 ))
( 0.105 ( 0.041047 0 0 ))
( 0.110 ( 0.042982 0 0 ))
( 0.115 ( 0.044915 0 0 ))
( 0.120 ( 0.046845 0 0 ))
( 0.125 ( 0.048773 0 0 ))
( 0.130 ( 0.050697 0 0 ))
( 0.135 ( 0.052618 0 0 ))
( 0.140 ( 0.054536 0 0 ))
( 0.145 ( 0.056450 0 0 ))
( 0.150 ( 0.058361 0 0 ))
( 0.155 ( 0.060269 0 0 ))
( 0.160 ( 0.062172 0 0 ))
( 0.165 ( 0.064072 0 0 ))
( 0.170 ( 0.065968 0 0 ))
( 0.175 ( 0.067860 0 0 ))
( 0.180 ( 0.069748 0 0 ))
( 0.185 ( 0.071631 0 0 ))
( 0.190 ( 0.073510 0 0 ))
( 0.195 ( 0.075384 0 0 ))
( 0.200 ( 0.077254 0 0 ))
( 0.205 ( 0.079119 0 0 ))
( 0.210 ( 0.080979 0 0 ))
( 0.215 ( 0.082834 0 0 ))
( 0.220 ( 0.084684 0 0 ))
( 0.225 ( 0.086529 0 0 ))
( 0.230 ( 0.088369 0 0 ))
( 0.235 ( 0.090203 0 0 ))
( 0.240 ( 0.092031 0 0 ))
( 0.245 ( 0.093854 0 0 ))
( 0.250 ( 0.095671 0 0 ))
( 0.255 ( 0.097482 0 0 ))
( 0.260 ( 0.099287 0 0 ))
( 0.265 ( 0.101086 0 0 ))
( 0.270 ( 0.102879 0 0 ))
( 0.275 ( 0.104665 0 0 ))
( 0.280 ( 0.106445 0 0 ))
( 0.285 ( 0.108218 0 0 ))
( 0.290 ( 0.109985 0 0 ))
( 0.295 ( 0.111745 0 0 ))
( 0.300 ( 0.113498 0 0 ))
( 0.305 ( 0.115244 0 0 ))
( 0.310 ( 0.116982 0 0 ))
( 0.315 ( 0.118714 0 0 ))
( 0.320 ( 0.120438 0 0 ))
( 0.325 ( 0.122155 0 0 ))
( 0.330 ( 0.123865 0 0 ))
( 0.335 ( 0.125566 0 0 ))
( 0.340 ( 0.127260 0 0 ))
( 0.345 ( 0.128946 0 0 ))
( 0.350 ( 0.130625 0 0 ))
( 0.355 ( 0.132295 0 0 ))
( 0.360 ( 0.133957 0 0 ))
( 0.365 ( 0.135610 0 0 ))
( 0.370 ( 0.137256 0 0 ))
( 0.375 ( 0.138893 0 0 ))
( 0.380 ( 0.140521 0 0 ))
( 0.385 ( 0.142140 0 0 ))
( 0.390 ( 0.143751 0 0 ))
( 0.395 ( 0.145353 0 0 ))
( 0.400 ( 0.146946 0 0 ))
( 0.405 ( 0.148530 0 0 ))
( 0.410 ( 0.150105 0 0 ))
( 0.415 ( 0.151671 0 0 ))
( 0.420 ( 0.153227 0 0 ))
( 0.425 ( 0.154773 0 0 ))
( 0.430 ( 0.156311 0 0 ))
( 0.435 ( 0.157838 0 0 ))
( 0.440 ( 0.159356 0 0 ))
( 0.445 ( 0.160864 0 0 ))
( 0.450 ( 0.162362 0 0 ))
( 0.455 ( 0.163850 0 0 ))
( 0.460 ( 0.165328 0 0 ))
( 0.465 ( 0.166796 0 0 ))
( 0.470 ( 0.168253 0 0 ))
( 0.475 ( 0.169700 0 0 ))
( 0.480 ( 0.171137 0 0 ))
( 0.485 ( 0.172563 0 0 ))
( 0.490 ( 0.173978 0 0 ))
...
)