oscillatingCylinderInChannel/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    front
    {
        type empty;
        physicalType empty;
    }
    back
    {
        type empty;
        physicalType empty;
    }
    up
    {
        type wall;
        physicalType wall;
    }
    down
    {
        type wall;
        physicalType wall;
    }
    left
    {
        type wall;
        physicalType wall;
    }
    right
    {
        type wall;
        physicalType wall;
    }
    cylinder
    {
        type wall;
        physicalType wall;
    }
}

// ************************************************************************* //
