oscillatingCylinderInChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         24;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

//purgeWrite      200;

writeFormat     ascii;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep no;

maxCo 10;

functions
{
   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       "writeControl|outputControl" timeStep;
       outputInterval      1;
       patches             (cylinder);
       "pName|p"           p;
       "UName|U"           U;
       "rhoName|rho"       rhoInf;
       log                 true;
       rhoInf              1;
       CofR                (0 0 0);
   }
}

// ************************************************************************* //
